[
  {
    "path": "posts/2021-03-13-git-readme/",
    "title": "Git Readme",
    "description": "How to setup a github user readme",
    "author": [
      {
        "name": "Kyle Tolliver",
        "url": {}
      }
    ],
    "date": "2021-03-13",
    "categories": [],
    "contents": "\r\nThis page is a tutorial for how to set up a useful readme for your github user.\r\nStep 0 – Git Setup\r\nInstall R and RStudio\r\nSetup up a Github user\r\nStep 1 – Create Repository\r\nFirst you will have to create a repository with the name of the repo the same as your github username.\r\n\r\nYou can see it’s set to public that is needed for everyone to see the repo. And Initialize the repo with a Readme File.\r\nStep 2 – Create Rmd file\r\nThere are two different ways to create the Rmd file for this project.\r\n2.1 – Method 1\r\nTop left of R Studio there is a white box with a plus in a green circle. Press that then a popup will show up. Go to templates and scroll till you find the github document template. It will open an untitled file. The file heading will say:\r\n--- \r\ntitle: \"Untitled\" \r\noutput: github_document \r\n---\r\nThen Change title to your name first and last. (For example if I was John Doe then the title would be ‘title: “John Doe”’)\r\nSave the file as Readme.Rmd\r\n2.2 – Method 2\r\nTop left of R Studio there is a white box with a plus in a green circle. Press that then a popup will show up. Pick any template for this method it doesn’t matter. It will open an untitled file. The file heading will say:\r\n--- \r\ntitle: \"Untitled\" \r\noutput: template_document\r\n---\r\nRewrite the heading to say:\r\n--- \r\ntitle: \"First_name Last_name\" \r\noutput: template_document\r\n---\r\nSave the file as Readme.Rmd\r\nStep 3 – Source the R Script\r\nYou can source a R script that will have the function useful for the readme file. The command needs to inside in an R chunk.\r\nsource(\"https://raw.githubusercontent.com/Tolli-Tech/Tolli-Coding/main/_posts/2021-03-13-git-readme/git-readme_files/git-readme.R\")\r\nOr you could just add this function in an R chunk.\r\nuser_stats <- function(user){\r\npander::pander(glue::glue('<h2>User Stats<\/h2>\r\n<a href=\"https://github.com/anuraghazra/github-readme-stats\" align=\"center\">\r\n<img style=\"max-width:100%;\" height=\"160\" align=\"center\" \r\nsrc=\"https://github-readme-stats.vercel.app/api/top-langs/?username={user}&layout=compact&theme=gruvbox\" /><\/a> \\n\\n\\n'))\r\n}\r\nStep 4 – Add Base Level Links\r\nLink important sites, such as:\r\nEportfolio\r\nResume\r\nCollege Diploma\r\nEtc.\r\nUse the link convention for Rmd files:\r\n[name](link)\r\nStep 5 – User Stats\r\nPut the following function call in a R chunk:\r\nuser_stats(username)\r\nFor example if my username was johndoe the function call would look like:\r\nuser_stats(johndoe)\r\nStep 6 – Highlights\r\nAdd a bulleted list of projects you want to highlight. Use the same link convention as earlier.\r\nStep 7 – Knit\r\nThere are two different ways to knit the Rmd in RStudio.\r\nMethod 7.1 – Short Keys\r\nThe short keys need are:\r\nWindows – Ctrl + Shift + K\r\nMac – Command + Shift + K\r\nMethod 7.2 – Manual Knit\r\nAt the top left corner off the Rmd file there is a button with yarn and needles with the ‘Knit’ next to it.\r\nStep 8 – Git It\r\nWhen you feel your Readme file is good, you would be read to push it to github. (You can edit and push the file over and over again)\r\nUse either the github website or github desktop app. Write a commit message, could be whatever you want. (A good commit message would be: ‘Readme.md edit’)\r\nThe push the file to to your repository.\r\nNow you are good to go and have a impressive Github profile.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-14T23:31:54-06:00",
    "input_file": {}
  }
]
